---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthOut
source: html/7f7f3836-756e-c3ec-8457-fae5c5b2cd34.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDepthOut Property

"Main Secondary Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDepthOut { get; }
```